package Linked
import kotlin.math.pow
/**
 * @author zhangzheng
 * @Date  2021/5/11 下午5:56
 * @ClassName `1290.Convert_Binary_Number_in_a_Linked_List_to_Integer`
 * <p>
 * Desc :二进制链表转整数
 */
//给你一个单链表的引用结点 head。链表中每个结点的值不是 0 就是 1。已知此链表是一个整数数字的二进制表示形式。
//
// 请你返回该链表所表示数字的 十进制值 。
//
//
//
// 示例 1：
//
//
//
// 输入：head = [1,0,1]
//输出：5
//解释：二进制数 (101) 转化为十进制数 (5)
//
//
// 示例 2：
//
// 输入：head = [0]
//输出：0
//
//
// 示例 3：
//
// 输入：head = [1]
//输出：1
//
//
// 示例 4：
//
// 输入：head = [1,0,0,1,0,0,1,1,1,0,0,0,0,0,0]
//输出：18880
//
//
// 示例 5：
//
// 输入：head = [0,0]
//输出：0
//
//
//
//
// 提示：
//
//
// 链表不为空。
// 链表的结点总数不超过 30。
// 每个结点的值不是 0 就是 1。
//
// Related Topics 位运算 链表
// 👍 80 👎

var index = 1.0
fun getDecimalValue(head: ListNode?): Int {
    return recursionToBinaryNumber(head)
}

// 利用递归的思想来进行解决
fun recursionToBinaryNumber(head: ListNode?): Int {

    if (head?.next == null) {
        return head?.`val` ?: 0 * (2.0.pow(index++).toInt())
    }
    //这里的递归是为了找到最后一个节点
    var sun = recursionToBinaryNumber(head.next)
    sun += head.`val` * (2.0.pow(index++).toInt())
    return sun
}